
let quotes=[
    "سبحان الله وبحمده",
    "الحمد لله",
    "لا إله إلا الله",
    "الله أكبر",
    "أستغفر الله",
    "لا حول ولا قوة إلا بالله",
    "أذكار الصباح",
    "أذكار المساء",
    "اللهم إني أعوذ بك من الشرور والفتن",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم صل وسلم على نبينا محمد",
    "اللهم اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء",
    "اللهم إنا نعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم انفعني بما علمتني وعلمني ما ينفعني",
    "اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل",
    "اللهم إني أسألك علما نافعا ورزقا طيبا وعملا متقبلا",
    "اللهم إني أسألك الجنة وما قرب إليها من قول وعمل وأعوذ بك من النار وما قرب إليها من قول وعمل",
    "اللهم إني أسألك عيشة هنيئة وميتة سوية ومردا غير مخز ولا فاضح",
    "اللهم إني أعوذ بك من جار السوء في دار المقامة",
    "اللهم اجعل لي في قلبي نورا وفي لساني نورا واجعل لي في سمعي نورا واجعل لي في بصري نورا",
    "اللهم أعني على ذكرك وشكرك وحسن عبادتك",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أعوذ بك من جهد البلاء وضيق المحلة وسوء القضاء وشماتة الأعداء",
    "اللهم إني أعوذ بك من الجوع فإنه بئس الضيف ومن الخذلان فإنه بئس المصيبة ومن القيلة فإنها شر الجنة",
    "اللهم إني أعوذ بك من البخل والجبن والهرم والمنة وعذاب القبر",
    "اللهم إني أعوذ بك من عذاب القبر ومن عذاب جهنم ومن فتنة المحيا والممات ومن فتنة المسيح الدجال",
    "اللهم إني أعوذ بك من الكسل والهرم والذلة والبخل والجبن وضلع الدين وغلبة الرجال",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أعوذ بك من جهد البلاء وضيق المحلة وسوء القضاء وشماتة الأعداء",
    "اللهم إني أسألك معافاة في الدنيا والآخرة",
    "اللهم إني أسألك العفو والعافية في الدنيا والآخرة"];




// let btn=document.querySelector('.btn');
// btn.addEventListener('click', displayQuote);

function displayQuote(){
    //create an index of a random number 
    //convert it into between 0 to length of quotes[]
    let index=Math.floor(Math.random()*quotes.length);
   
    //display the quote of that index
    let div=document.querySelector('#quote');
    let quote=`<div class="card">
    <img src="icons/favicon.png">
    <p>${quotes[index]}</p>
    <img src="icons/favicon.png">
   </div>

    `;
    div.innerHTML=quote;
    
}

